In [47]:
import numpy as np 
import pandas as pd

In [48]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [49]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [50]:
date.info() # here date column is object so we can't perform on it 1st we have to convert it into date type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [51]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

<h1>Working with dates</h1>

In [52]:
#converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [53]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

<h3>extracting year</h3>

In [54]:
date['date_year'] = date['date'].dt.year
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

<h3>extracting month</h3>

In [55]:
date['date_month'] = date['date'].dt.month
date.head()

        date  product_id  city_id  orders  date_year  date_month
0 2019-12-10        5628       25       3       2019          12
1 2018-08-15        3646       14     157       2018           8
2 2018-10-23        1859       25       1       2018          10
3 2019-08-17        7292       25       1       2019           8
4 2019-01-06        4344       25       3       2019           1

In [56]:
date['date_month_name'] = date['date'].dt.month_name()
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [57]:
date['date_day'] = date['date'].dt.day
date['date_week'] = date['date'].dt.dayofweek
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_week
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [58]:
# day of week name
date['date_dow_name'] = date['date'].dt.day_name()
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_week,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [64]:
# is weekend
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday' , 'Saturday']) , 1,0)
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_week,date_dow_name,date_is_weekend,date_week_of_year
0,2019-12-10,2019,12,December,10,50,Tuesday,0,50
1,2018-08-15,2018,8,August,15,33,Wednesday,0,33
2,2018-10-23,2018,10,October,23,43,Tuesday,0,43
3,2019-08-17,2019,8,August,17,33,Saturday,1,33
4,2019-01-06,2019,1,January,6,1,Sunday,1,1

In [65]:
# extracct week of the year
date['date_week_of_year'] = date['date'].dt.isocalendar().week
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_week,date_dow_name,date_is_weekend,date_week_of_year
0,2019-12-10,2019,12,December,10,50,Tuesday,0,50
1,2018-08-15,2018,8,August,15,33,Wednesday,0,33
2,2018-10-23,2018,10,October,23,43,Tuesday,0,43
3,2019-08-17,2019,8,August,17,33,Saturday,1,33
4,2019-01-06,2019,1,January,6,1,Sunday,1,1

In [66]:
#extract quarter
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_week,date_dow_name,date_is_weekend,date_week_of_year,quarter
0,2019-12-10,2019,12,December,10,50,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,33,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,43,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,33,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,1,Sunday,1,1,1

In [68]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_week,date_dow_name,date_is_weekend,date_week_of_year,quarter,semester
0,2019-12-10,2019,12,December,10,50,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,33,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,43,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,33,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,1,Sunday,1,1,1,1

<h1>Extract Time elapsed between dates</h1>

In [74]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2026, 2, 28, 11, 55, 42, 60734)

In [75]:
today - date['date']

0     2272 days 11:55:42.060734
1     2754 days 11:55:42.060734
2     2685 days 11:55:42.060734
3     2387 days 11:55:42.060734
4     2610 days 11:55:42.060734
                 ...
995   2700 days 11:55:42.060734
996   2641 days 11:55:42.060734
997   2489 days 11:55:42.060734
998   2554 days 11:55:42.060734
999   2328 days 11:55:42.060734
Name: date, Length: 1000, dtype: timedelta64[ns]

In [77]:
today-date['date'].dt.day

TypeError: Addition/subtraction of integers and integer-arrays with Timestamp is no longer supported.  Instead of adding/subtracting `n`, use `n * obj.freq`